/* eslint-disable indent */
/* eslint-disable quotes */
/* eslint-disable quote-props */
export const countryMap = {
  CN: {
    l: '中国',
    p: '+86',
  },
  MO: {
    l: '中国澳门',
    p: '+853',
  },
  TW: {
    l: '中国台湾',
    p: '+886',
  },
  HK: {
    l: '中国香港',
    p: '+852',
  },
  AL: {
    l: '阿尔巴尼亚',
    p: '+355',
  },
  DZ: {
    l: '阿尔及利亚',
    p: '+213',
  },
  AF: {
    l: '阿富汗',
    p: '+93',
  },
  AR: {
    l: '阿根廷',
    p: '+54',
  },
  AE: {
    l: '阿拉伯联合大公国',
    p: '+971',
  },
  AW: {
    l: '阿鲁巴',
    p: '+297',
  },
  OM: {
    l: '阿曼',
    p: '+968',
  },
  AZ: {
    l: '阿塞拜疆',
    p: '+994',
  },
  EG: {
    l: '埃及',
    p: '+20',
  },
  ET: {
    l: '埃塞俄比亚',
    p: '+251',
  },
  IE: {
    l: '爱尔兰',
    p: '+353',
  },
  EE: {
    l: '爱沙尼亚',
    p: '+372',
  },
  AD: {
    l: '安道尔',
    p: '+376',
  },
  AO: {
    l: '安哥拉',
    p: '+244',
  },
  AI: {
    l: '安圭拉',
    p: '+1264',
  },
  AG: {
    l: '安提瓜和巴布达',
    p: '+1268',
  },
  AT: {
    l: '奥地利',
    p: '+43',
  },
  AU: {
    l: '澳大利亚',
    p: '+61',
  },
  BB: {
    l: '巴巴多斯',
    p: '+1246',
  },
  PG: {
    l: '巴布亚新几内亚',
    p: '+675',
  },
  BS: {
    l: '巴哈马',
    p: '+1242',
  },
  PK: {
    l: '巴基斯坦',
    p: '+92',
  },
  PY: {
    l: '巴拉圭',
    p: '+595',
  },
  PS: {
    l: '巴勒斯坦领土',
    p: '+970',
  },
  BH: {
    l: '巴林',
    p: '+973',
  },
  PA: {
    l: '巴拿马',
    p: '+507',
  },
  BR: {
    l: '巴西',
    p: '+55',
  },
  BY: {
    l: '白俄罗斯',
    p: '+375',
  },
  BM: {
    l: '百慕大',
    p: '+1441',
  },
  BG: {
    l: '保加利亚',
    p: '+359',
  },
  BJ: {
    l: '贝宁',
    p: '+229',
  },
  BE: {
    l: '比利时',
    p: '+32',
  },
  IS: {
    l: '冰岛',
    p: '+354',
  },
  PR: {
    l: '波多黎各',
    p: '+1787',
  },
  PL: {
    l: '波兰',
    p: '+48',
  },
  BA: {
    l: '波斯尼亚和黑塞哥维那',
    p: '+387',
  },
  BO: {
    l: '玻利维亚',
    p: '+591',
  },
  BZ: {
    l: '伯利兹',
    p: '+501',
  },
  BW: {
    l: '博茨瓦纳',
    p: '+267',
  },
  BT: {
    l: '不丹',
    p: '+975',
  },
  BF: {
    l: '布基纳法索',
    p: '+226',
  },
  BI: {
    l: '布隆迪',
    p: '+257',
  },
  KP: {
    l: '朝鲜',
    p: '+850',
  },
  GQ: {
    l: '赤道几内亚',
    p: '+240',
  },
  DK: {
    l: '丹麦',
    p: '+45',
  },
  DE: {
    l: '德国',
    p: '+49',
  },
  TL: {
    l: '东帝汶',
    p: '+670',
  },
  TG: {
    l: '多哥',
    p: '+228',
  },
  DM: {
    l: '多米尼加',
    p: '+1767',
  },
  DO: {
    l: '多明尼加共和国',
    p: '+1809',
  },
  RU: {
    l: '俄罗斯',
    p: '+7',
  },
  EC: {
    l: '厄瓜多尔',
    p: '+593',
  },
  ER: {
    l: '厄立特里亚',
    p: '+291',
  },
  FR: {
    l: '法国',
    p: '+33',
  },
  FO: {
    l: '法罗群岛',
    p: '+298',
  },
  PF: {
    l: '法属波利尼西亚',
    p: '+689',
  },
  GF: {
    l: '法属圭亚那',
    p: '+594',
  },
  PH: {
    l: '菲律宾',
    p: '+63',
  },
  FJ: {
    l: '斐济',
    p: '+679',
  },
  FI: {
    l: '芬兰',
    p: '+358',
  },
  CV: {
    l: '佛得角',
    p: '+238',
  },
  GM: {
    l: '冈比亚',
    p: '+220',
  },
  CG: {
    l: '刚果共和国',
    p: '+242',
  },
  CD: {
    l: '刚果民主共和国',
    p: '+243',
  },
  CO: {
    l: '哥伦比亚',
    p: '+57',
  },
  CR: {
    l: '哥斯达黎加',
    p: '+506',
  },
  GD: {
    l: '格林纳达',
    p: '+1473',
  },
  GL: {
    l: '格陵兰',
    p: '+299',
  },
  GE: {
    l: '格鲁吉亚',
    p: '+995',
  },
  CU: {
    l: '古巴',
    p: '+53',
  },
  GP: {
    l: '瓜德罗普岛',
    p: '+590',
  },
  GU: {
    l: '关岛',
    p: '+1671',
  },
  GY: {
    l: '圭亚那',
    p: '+592',
  },
  KZ: {
    l: '哈萨克斯坦',
    p: '+7',
  },
  HT: {
    l: '海地',
    p: '+509',
  },
  KR: {
    l: '韩国',
    p: '+82',
  },
  NL: {
    l: '荷兰',
    p: '+31',
  },
  AN: {
    l: '荷属安的列斯群岛',
    p: '+599',
  },
  ME: {
    l: '黑山',
    p: '+382',
  },
  HN: {
    l: '洪都拉斯',
    p: '+504',
  },
  DJ: {
    l: '吉布提',
    p: '+253',
  },
  KG: {
    l: '吉尔吉斯斯坦',
    p: '+996',
  },
  GN: {
    l: '几内亚',
    p: '+224',
  },
  GW: {
    l: '几内亚比绍',
    p: '+245',
  },
  CA: {
    l: '加拿大',
    p: '+1',
  },
  GH: {
    l: '加纳',
    p: '+233',
  },
  GA: {
    l: '加蓬',
    p: '+241',
  },
  KH: {
    l: '柬埔寨',
    p: '+855',
  },
  CZ: {
    l: '捷克共和国',
    p: '+420',
  },
  ZW: {
    l: '津巴布韦',
    p: '+263',
  },
  CM: {
    l: '喀麦隆',
    p: '+237',
  },
  QA: {
    l: '卡塔尔',
    p: '+974',
  },
  KY: {
    l: '开曼群岛',
    p: '+1345',
  },
  KM: {
    l: '科摩罗',
    p: '+269',
  },
  KW: {
    l: '科威特',
    p: '+965',
  },
  HR: {
    l: '克罗地亚',
    p: '+385',
  },
  KE: {
    l: '肯尼亚',
    p: '+254',
  },
  CK: {
    l: '库克群岛',
    p: '+682',
  },
  LV: {
    l: '拉脱维亚',
    p: '+371',
  },
  LS: {
    l: '莱索托',
    p: '+266',
  },
  LA: {
    l: '老挝',
    p: '+856',
  },
  LB: {
    l: '黎巴嫩',
    p: '+961',
  },
  LT: {
    l: '立陶宛',
    p: '+370',
  },
  LR: {
    l: '利比里亚',
    p: '+231',
  },
  LY: {
    l: '利比亚',
    p: '+218',
  },
  LI: {
    l: '列支敦士登',
    p: '+423',
  },
  RE: {
    l: '留尼旺岛',
    p: '+262',
  },
  LU: {
    l: '卢森堡',
    p: '+352',
  },
  RW: {
    l: '卢旺达',
    p: '+250',
  },
  RO: {
    l: '罗马尼亚',
    p: '+40',
  },
  MG: {
    l: '马达加斯加',
    p: '+261',
  },
  MV: {
    l: '马尔代夫',
    p: '+960',
  },
  MT: {
    l: '马耳他',
    p: '+356',
  },
  MW: {
    l: '马拉维',
    p: '+265',
  },
  MY: {
    l: '马来西亚',
    p: '+60',
  },
  ML: {
    l: '马里',
    p: '+223',
  },
  MK: {
    l: '马其顿',
    p: '+389',
  },
  MQ: {
    l: '马提尼克',
    p: '+596',
  },
  MU: {
    l: '毛里求斯',
    p: '+230',
  },
  MR: {
    l: '毛里塔尼亚',
    p: '+222',
  },
  US: {
    l: '美国',
    p: '+1',
  },
  MN: {
    l: '蒙古',
    p: '+976',
  },
  MS: {
    l: '蒙特塞拉特',
    p: '+1664',
  },
  BD: {
    l: '孟加拉国',
    p: '+880',
  },
  PE: {
    l: '秘鲁',
    p: '+51',
  },
  MD: {
    l: '摩尔多瓦',
    p: '+373',
  },
  MA: {
    l: '摩洛哥',
    p: '+212',
  },
  MC: {
    l: '摩纳哥',
    p: '+377',
  },
  MZ: {
    l: '莫桑比克',
    p: '+258',
  },
  MX: {
    l: '墨西哥',
    p: '+52',
  },
  NA: {
    l: '纳米比亚',
    p: '+264',
  },
  ZA: {
    l: '南非',
    p: '+27',
  },
  SS: {
    l: '南苏丹',
    p: '+211',
  },
  NP: {
    l: '尼泊尔',
    p: '+977',
  },
  NI: {
    l: '尼加拉瓜',
    p: '+505',
  },
  NE: {
    l: '尼日尔',
    p: '+227',
  },
  NG: {
    l: '尼日利亚',
    p: '+234',
  },
  NO: {
    l: '挪威',
    p: '+47',
  },
  PT: {
    l: '葡萄牙',
    p: '+351',
  },
  JP: {
    l: '日本',
    p: '+81',
  },
  SE: {
    l: '瑞典',
    p: '+46',
  },
  CH: {
    l: '瑞士',
    p: '+41',
  },
  SV: {
    l: '萨尔瓦多',
    p: '+503',
  },
  WS: {
    l: '萨摩亚',
    p: '+685',
  },
  RS: {
    l: '塞尔维亚',
    p: '+381',
  },
  SL: {
    l: '塞拉利昂',
    p: '+232',
  },
  SN: {
    l: '塞内加尔',
    p: '+221',
  },
  CY: {
    l: '塞浦路斯',
    p: '+357',
  },
  SC: {
    l: '塞舌尔',
    p: '+248',
  },
  SA: {
    l: '沙特阿拉伯',
    p: '+966',
  },
  ST: {
    l: '圣多美和普林西比',
    p: '+239',
  },
  KN: {
    l: '圣基茨和尼维斯',
    p: '+1869',
  },
  LC: {
    l: '圣卢西亚',
    p: '+1758',
  },
  SM: {
    l: '圣马力诺',
    p: '+378',
  },
  PM: {
    l: '圣皮埃尔和密克隆群岛',
    p: '+508',
  },
  VC: {
    l: '圣文森特和格林纳丁斯',
    p: '+1784',
  },
  LK: {
    l: '斯里兰卡',
    p: '+94',
  },
  SK: {
    l: '斯洛伐克',
    p: '+421',
  },
  SI: {
    l: '斯洛文尼亚',
    p: '+386',
  },
  SZ: {
    l: '斯威士兰',
    p: '+268',
  },
  SD: {
    l: '苏丹',
    p: '+249',
  },
  SR: {
    l: '苏里南',
    p: '+597',
  },
  SO: {
    l: '索马里',
    p: '+252',
  },
  TJ: {
    l: '塔吉克斯坦',
    p: '+992',
  },
  TH: {
    l: '泰国',
    p: '+66',
  },
  TZ: {
    l: '坦桑尼亚',
    p: '+255',
  },
  TO: {
    l: '汤加',
    p: '+676',
  },
  TC: {
    l: '特克斯和凯科斯群岛',
    p: '+1649',
  },
  TT: {
    l: '特里尼达和多巴哥',
    p: '+1868',
  },
  TN: {
    l: '突尼斯',
    p: '+216',
  },
  TR: {
    l: '土耳其',
    p: '+90',
  },
  TM: {
    l: '土库曼斯坦',
    p: '+993',
  },
  VU: {
    l: '瓦努阿图',
    p: '+678',
  },
  GT: {
    l: '危地马拉',
    p: '+502',
  },
  VE: {
    l: '委内瑞拉',
    p: '+58',
  },
  BN: {
    l: '文莱',
    p: '+673',
  },
  UG: {
    l: '乌干达',
    p: '+256',
  },
  UA: {
    l: '乌克兰',
    p: '+380',
  },
  UY: {
    l: '乌拉圭',
    p: '+598',
  },
  UZ: {
    l: '乌兹别克斯坦',
    p: '+998',
  },
  ES: {
    l: '西班牙',
    p: '+34',
  },
  GR: {
    l: '希腊',
    p: '+30',
  },
  CI: {
    l: '象牙海岸',
    p: '+225',
  },
  SG: {
    l: '新加坡',
    p: '+65',
  },
  NC: {
    l: '新喀里多尼亚',
    p: '+687',
  },
  NZ: {
    l: '新西兰',
    p: '+64',
  },
  HU: {
    l: '匈牙利',
    p: '+36',
  },
  SY: {
    l: '叙利亚',
    p: '+963',
  },
  JM: {
    l: '牙买加',
    p: '+1876',
  },
  AM: {
    l: '亚美尼亚',
    p: '+374',
  },
  YE: {
    l: '也门',
    p: '+967',
  },
  IQ: {
    l: '伊拉克',
    p: '+964',
  },
  IR: {
    l: '伊朗',
    p: '+98',
  },
  IL: {
    l: '以色列',
    p: '+972',
  },
  IT: {
    l: '意大利',
    p: '+39',
  },
  IN: {
    l: '印度',
    p: '+91',
  },
  ID: {
    l: '印尼',
    p: '+62',
  },
  GB: {
    l: '英国',
    p: '+44',
  },
  VG: {
    l: '英属维尔京群岛',
    p: '+1340',
  },
  JO: {
    l: '约旦',
    p: '+962',
  },
  VN: {
    l: '越南',
    p: '+84',
  },
  ZM: {
    l: '赞比亚',
    p: '+260',
  },
  JE: {
    l: '泽西岛',
    p: '+44',
  },
  TD: {
    l: '乍得',
    p: '+235',
  },
  GI: {
    l: '直布罗陀',
    p: '+350',
  },
  CL: {
    l: '智利',
    p: '+56',
  },
  CF: {
    l: '中非共和国',
    p: '+236',
  },
};
